# brew commands
tap "beeftornado/rmtree"
tap "homebrew/bundle"

# drivers
# tap "homebrew/cask-drivers"
#cask "asix-ax88179" # manuall install

# libs
tap "homebrew-ffmpeg/ffmpeg"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]

# cli tools
brew "age"
brew "azure-cli" # takes forever
brew "berkeley-db"
brew "cmake"
brew "cocoapods"
brew "consul-template"
brew "coreutils", link: true
brew "dark-mode"
brew "direnv"
brew "exa"
brew "fasd"
brew "findutils", link: true
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "go-task"
brew "helm"
brew "htop"
brew "ical-buddy"
brew "ifstat"
brew "jmeter"
brew "jq"
brew "k9s"
brew "lcov"
brew "lsusb"
brew "macvim"
brew "mise"
brew "moreutils", link: true
brew "neofetch"
brew "nmap"
# brew "openjdk@8" # no apple silicon
brew "openjdk@11"
brew "openjdk@20"
brew "openssh", link: false
brew "p7zip"
brew "perl"
brew "pinentry-mac" # gpg
brew "pv"
brew "python@3.9"
brew "screen"
brew "skopeo"
brew "sops"
brew "subversion"
brew "terraform"
brew "tldr"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "zlib"
brew "zsh"
brew "zsh-completions"

# rcm
tap "thoughtbot/formulae"
brew "thoughtbot/formulae/rcm"

# hashicorp tools
tap "hashicorp/tap"
brew "vault"

# yabai
tap "koekeishiya/formulae"
brew "koekeishiya/formulae/yabai", restart_service: true
brew "koekeishiya/formulae/skhd", restart_service: true

# docker
brew "colima"
brew "docker"
brew "docker-compose"

# k8s
brew "fluxcd/tap/flux", link: true
brew "k3sup"
brew "kubectx"
brew "kubeconform"
brew "kustomize"
brew "velero"

# azure
tap "azure/kubelogin"
brew "azure/kubelogin/kubelogin"

# dotnet
tap "isen-ng/dotnet-sdk-versions"
cask "dotnet-sdk"
cask "dotnet-sdk2-1-800"
cask "dotnet-sdk2-2-200"
cask "dotnet-sdk2-2-300"
cask "dotnet-sdk3-1-400"
brew "nuget"

# tap "FelixKratz/formulae"
# brew "sketchybar", restart_service: true

tap "weaveworks/tap"
brew "weaveworks/tap/gitops"

tap "sandreas/tap"
brew "sandreas/tap/m4b-tool"

#########
# Casks #
#########

# Tools
cask "alfred"
cask "alacritty"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"
cask "appcleaner"
cask "bettertouchtool"
cask "brave-browser"
cask "brave-browser-beta"
# cask "chromium"
cask "flux"
cask "forklift"
# cask "google-chrome"
cask "growlnotify"
cask "home-assistant"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "keepassxc"
cask "keka"
cask "krisp"
cask "launchrocket"
cask "macupdater"
cask "moneymoney"
cask "monitorcontrol"
cask "mqtt-explorer"
cask "muzzle"
cask "nextcloud"
cask "numi"
cask "obsidian"
cask "phoenix"
cask "plexamp"
cask "postman"
cask "raycast"
cask "rocket"
cask "scroll-reverser"
cask "shottr"
cask "steam"
cask "telegram"
cask "todoist"
cask "transmission"
cask "tunnelblick"
cask "ubersicht"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "yt-music"
cask "xquartz"

# Fonts
cask "font-fira-code"
cask "font-hasklig"
cask "font-inconsolata"
cask "font-input"
cask "font-poppins"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
# + https://pcaro.es/p/hermit/#downloads


# Firefox
cask "firefox"
cask "firefox-developer-edition"

# 1 Password
cask "1password-cli"
cask "1password"

# https://github.com/shinokada/consize - image converter
tap "shinokada/consize"
brew "consize"
