mafredri/zsh-async

zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
Tarrasch/zsh-autoenv
ohmyzsh/ohmyzsh folder:plugins/gitfast
ohmyzsh/ohmyzsh folder:plugins/asdf

sindresorhus/pure
zdharma/fast-syntax-highlighting
zsh-users/zsh-history-substring-search
